MRC757/ESP32-WWVB-NTP-Time-Server/wwvb_clock.ino
    // Calculate layout positions dynamically based on display orientation
    // Different layouts for landscape vs portrait mode
    if (DISPLAY_WIDTH > DISPLAY_HEIGHT) {
        // Landscape mode (536x240) - 4 equal sections of 60 pixels each
        CLOCK_Y = 0;                            // Section 1: Time
        DATE_Y = 60;                            // Section 2: Date
        STATUS_Y = 120;                         // Section 3: Status
        CHART_Y = 180;                          // Section 4: Chart
        CHART_HEIGHT = 60;                      // Equal height for chart
    } else {
        // Portrait mode (240x536) - percentage-based layout
        CLOCK_Y = DISPLAY_HEIGHT * 0.04;        // 4% from top
        DATE_Y = DISPLAY_HEIGHT * 0.26;         // 26% from top
        STATUS_Y = DISPLAY_HEIGHT * 0.37;       // 37% from top
        CHART_Y = DISPLAY_HEIGHT * 0.52;        // 52% from top
        CHART_HEIGHT = DISPLAY_HEIGHT * 0.38;   // 38% of height for chart
    }
    
    // Load saved settings
    preferences.begin("wwvb", true);
    currentBrightness = preferences.getUChar("brightness", DISPLAY_BRIGHTNESS);
    utcOffset = preferences.getChar("utcOffset", -5);  // Default: Eastern Time
    preferences.end();
    amoled.setBrightness(currentBrightness);
    Serial.printf("[DISPLAY] Brightness set to %d\n", currentBrightness);

    // Calculate slider geometry based on display dimensions
    sliderX = 40;
    sliderWidth = DISPLAY_WIDTH - 80;
    sliderY = 100;
    sliderHeight = 30;

    // NOTE: We do NOT call tft.init() - it's only needed for sprite creation
    // Calling init() would try to initialize non-existent hardware and crash

    // Check PSRAM availability (warn but continue if not found)
    if (!psramFound()) {
        Serial.println("WARNING: PSRAM not detected!");
        Serial.println("Sprite creation may fail. Check platformio.ini PSRAM settings.");
    } else {
        Serial.printf("PSRAM available: %d bytes free\n", ESP.getFreePsram());
    }

    // Create sprite for entire screen (double-buffering)
    Serial.printf("[DISPLAY] Creating sprite: %d x %d (%lu bytes)\n",
                 DISPLAY_WIDTH, DISPLAY_HEIGHT,
                 (unsigned long)(DISPLAY_WIDTH * DISPLAY_HEIGHT * 2));

    void* spritePtr = sprite.createSprite(DISPLAY_WIDTH, DISPLAY_HEIGHT);
    if (spritePtr == nullptr) {
        Serial.println("[DISPLAY] ERROR: Sprite creation failed - not enough memory!");
        Serial.printf("[DISPLAY] Free heap: %d, Free PSRAM: %d\n",
                     ESP.getFreeHeap(), ESP.getFreePsram());
        while (1) {
            delay(1000);
            Serial.println("[DISPLAY] HALTED - Sprite creation failed");
        }
    }
    Serial.println("[DISPLAY] Sprite created successfully");

    sprite.setSwapBytes(true);
    Serial.println("[DISPLAY] Sprite configured (setSwapBytes)");

    // Clear sprite
    sprite.fillSprite(COLOR_BACKGROUND);
    Serial.println("[DISPLAY] Sprite cleared");

    // Clear screen to black
    Serial.println("[DISPLAY] Clearing screen to black...");
    sprite.fillSprite(TFT_BLACK);
    amoled.pushColors(0, 0, DISPLAY_WIDTH, DISPLAY_HEIGHT, (uint16_t*)sprite.getPointer());

    // Give display time to update
    delay(50);

    Serial.println("[DISPLAY] Display initialization complete!");
}

void pushDisplay() {
    // Push the sprite buffer to the AMOLED display
    amoled.pushColors(0, 0, DISPLAY_WIDTH, DISPLAY_HEIGHT, (uint16_t*)sprite.getPointer());
}

void drawCenteredText(const char* text, int y, uint16_t color, uint8_t textSize) {
    sprite.setTextSize(textSize);
    sprite.setTextColor(color, COLOR_BACKGROUND);
    sprite.setTextDatum(TC_DATUM);  // Top-center alignment
    sprite.drawString(text, DISPLAY_WIDTH / 2, y);
}

void drawClockFace(bool showUTC = false) {
    char timeStr[16];
    char dateStr[32];
    char secStr[8];

    ClockTime dt = showUTC ? timeManager.getUTCTime() : timeManager.getLocalTime(utcOffset, dstActive);
    
    // Format time HH:MM
    snprintf(timeStr, sizeof(timeStr), "%02d:%02d", dt.hour, dt.minute);
    
    // Format seconds
    snprintf(secStr, sizeof(secStr), ":%02d", dt.second);
    
    // Format date - Day, Month DD, YYYY
    const char* dayNames[] = {"Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"};
    const char* monthNames[] = {"Jan", "Feb", "Mar", "Apr", "May", "Jun", 
                                 "Jul", "Aug", "Sep", "Oct", "Nov", "Dec"};
    
    int dayOfWeek = timeManager.calculateDayOfWeek(dt.year, dt.month, dt.day);
    snprintf(dateStr, sizeof(dateStr), "%s, %s %02d, %04d", 
             dayNames[dayOfWeek], 
             monthNames[dt.month - 1], 
             dt.day, 
             dt.year);
    
    // Clear clock area (from CLOCK_Y to STATUS_Y)
    sprite.fillRect(0, CLOCK_Y, DISPLAY_WIDTH, STATUS_Y - CLOCK_Y, COLOR_BACKGROUND);
    
    // Draw main time (same size as date)
    sprite.setTextSize(2);
    sprite.setTextColor(COLOR_TIME, COLOR_BACKGROUND);
    sprite.setTextDatum(TC_DATUM);

    // Calculate widths for proper centering
    int16_t timeWidth = sprite.textWidth(timeStr);
    sprite.setTextSize(2);  // Temporarily set to seconds size
    int16_t secWidth = sprite.textWidth(secStr);
    int16_t spacing = 5;
    int16_t totalWidth = timeWidth + spacing + secWidth;
    int16_t timeX = (DISPLAY_WIDTH - totalWidth) / 2;

    // Draw time string
    sprite.setTextSize(2);
    sprite.setTextDatum(TL_DATUM);  // Top-left for precise positioning
    sprite.drawString(timeStr, timeX, CLOCK_Y);

    // Draw seconds (same size, to the right)
    sprite.setTextSize(2);
    sprite.drawString(secStr, timeX + timeWidth + spacing, CLOCK_Y);
    
    // Draw date
    drawCenteredText(dateStr, DATE_Y, COLOR_DATE, 2);

    // Draw time zone label in top-left
    sprite.setTextSize(1);
    sprite.setTextColor(COLOR_TEXT_DIM, COLOR_BACKGROUND);
    sprite.setTextDatum(TL_DATUM);
    if (showUTC) {
        sprite.drawString("UTC", 2, 2);
    } else {
        char tzLabel[12];
        snprintf(tzLabel, sizeof(tzLabel), "UTC%+d", utcOffset);
        sprite.drawString(tzLabel, 2, 2);
    }

    // Low battery warning in top-right corner
    if (lowBatteryAlerted) {
        sprite.setTextSize(1);
        sprite.setTextColor(TFT_RED, COLOR_BACKGROUND);
        sprite.setTextDatum(TR_DATUM);
        sprite.drawString("LOW BATT", DISPLAY_WIDTH - 2, 2);
    }
}

void drawSyncStatus() {
    char statusStr[64];
    uint16_t statusColor;
    
