MRC757/ESP32-WWVB-NTP-Time-Server/wwvb_clock.ino
    // Use synchronous scan — blocks ~2-4s but is reliable on ESP32-S3
    Serial.println("[WIFI] Scan starting (synchronous)...");
    wifiState = WIFI_STATE_SCANNING;
    updateDisplay();  // Show "Scanning..." on screen immediately

    int16_t result = WiFi.scanNetworks(false, false, false, 300);
    // false=synchronous, false=no hidden, false=active scan, 300ms per channel

    if (result > 0) {
        scannedCount = min((int)result, (int)WIFI_MAX_NETWORKS);
        for (int i = 0; i < scannedCount; i++) {
            scannedSSIDs[i] = WiFi.SSID(i);
            scannedRSSI[i] = WiFi.RSSI(i);
            scannedSecure[i] = (WiFi.encryptionType(i) != WIFI_AUTH_OPEN);
            Serial.printf("[WIFI]   %d: %s (%d dBm) %s\n", i,
                         scannedSSIDs[i].c_str(), scannedRSSI[i],
                         scannedSecure[i] ? "secured" : "open");
        }
        Serial.printf("[WIFI] Scan complete: %d networks found\n", scannedCount);

        // Build HTML options for captive portal
        String htmlOptions = "";
        for (int i = 0; i < scannedCount; i++) {
            htmlOptions += "<option value='" + scannedSSIDs[i] + "'>" + scannedSSIDs[i];
            htmlOptions += " (" + String(scannedRSSI[i]) + " dBm)";
            if (scannedSecure[i]) htmlOptions += " secured";
            htmlOptions += "</option>";
        }
        captivePortal.setNetworkList(htmlOptions);
        WiFi.scanDelete();
    } else {
        scannedCount = 0;
        Serial.printf("[WIFI] Scan returned %d (0=none found, -1=running, -2=failed)\n", result);
    }

    wifiState = WIFI_STATE_IDLE;
    lastWifiScan = millis();
    listScrollOffset = 0;
}

// No longer needed (scan is synchronous) but kept as no-op for wifiLoop compatibility
void wifiCheckScanResults() {
    // Synchronous scan handles results inline in wifiScan()
}

void wifiConnect(const String& ssid, const String& password) {
    wifiSSID = ssid;
    wifiPassword = password;
    wifiErrorMsg = "";

    WiFi.mode(WIFI_STA);
    WiFi.setMinSecurity(WIFI_AUTH_WEP);  // Allow all security types including WPA/mixed
    delay(100);

    WiFi.begin(ssid.c_str(), password.c_str());
    wifiConnectStart = millis();
    wifiState = WIFI_STATE_CONNECTING;

    Serial.printf("[WIFI] Connecting to: %s (mode=%d, pw_len=%d)\n",
                  ssid.c_str(), WiFi.getMode(), password.length());
}

void wifiCheckConnection() {
    if (WiFi.status() == WL_CONNECTED) {
        wifiState = WIFI_STATE_CONNECTED;
        wifiErrorMsg = "";
        Serial.printf("[WIFI] Connected! IP: %s\n", WiFi.localIP().toString().c_str());

        // Save credentials
        preferences.begin("wifi", false);
        preferences.putString("ssid", wifiSSID);
        preferences.putString("pass", wifiPassword);
        preferences.end();
        Serial.println("[WIFI] Credentials saved");

        // Start NTP server on the local network
        if (!ntpServer.isRunning()) {
            ntpServer.begin(&timeManager);
        }

        // Start status web server on the local network
        if (!statusServer.isRunning()) {
            statusServer.setTimeManager(&timeManager);
            statusServer.setNTPServer(&ntpServer);
            statusServer.setStatusData(&statusData);
            statusServer.setReceptionHistory(&receptionHistory);
            statusServer.setOnSyncRequest([]() {
                daytimeSkipActive = false;
                daytimeFailures = 0;
                if (!es100Receiving && !pendingTrackingStart) startWWVBSync(true); // force normal mode
            });
            statusServer.setOnTrackingRequest([]() {
                daytimeSkipActive = false;
                daytimeFailures = 0;
                if (!es100Receiving && !pendingTrackingStart) startWWVBSyncTracking();
            });
            statusServer.setOnSettingsRequest([](int8_t off, bool dst) {
                utcOffset = off;
                dstActive = dst;
                preferences.begin("wwvb", false);
                preferences.putChar("utcOffset", utcOffset);
                preferences.putBool("dst", dstActive);
                preferences.end();
                captivePortal.setTimezone(utcOffset, dstActive);
                Serial.printf("[SETTINGS] UTC offset=%+d DST=%s (via web)\n",
                              utcOffset, dstActive ? "on" : "off");
            });
            statusServer.setSyncLog(syncLog, &syncLogHead, &syncLogFilled);
            statusServer.begin();
        }

        // Auto-sync time from NTP if WWVB hasn't synced recently (>2 hours)
        unsigned long sinceLast = (lastTimeSyncMillis > 0) ? millis() - lastTimeSyncMillis : UINT32_MAX;
        if (lastTimeSource != TIME_SRC_WWVB || sinceLast > 7200000UL) {
            Serial.println("[WIFI] Auto-syncing time from NTP...");
            ntpClientSync();
        }
    } else if (millis() - wifiConnectStart > WIFI_CONNECT_TIMEOUT) {
        wifiState = WIFI_STATE_IDLE;
        wifiErrorMsg = "Connection failed";
        WiFi.disconnect();
        Serial.println("[WIFI] Connection timeout");
    }
}

void wifiStartAP() {
    Serial.println("[WIFI] Starting AP mode...");
    Serial.flush();

    // Clean up any prior STA state before switching to AP
    WiFi.scanDelete();
    WiFi.disconnect();
    delay(100);

    // Go directly to AP mode — do NOT use WIFI_OFF first,
    // as the ESP32-S3 WiFi driver crashes on OFF→AP transitions
    bool apOk = WiFi.softAP(WIFI_AP_SSID);  // softAP() handles mode switch internally
    if (!apOk) {
        Serial.println("[WIFI] softAP failed!");
        wifiErrorMsg = "AP start failed";
        wifiState = WIFI_STATE_IDLE;
        return;
    }
    delay(500);  // Let AP fully stabilize before starting servers

    Serial.printf("[WIFI] AP started: %s  IP: %s\n",
                 WIFI_AP_SSID, WiFi.softAPIP().toString().c_str());
    Serial.flush();

    captivePortal.setOnCredentials([](const String& ssid, const String& password) {
        Serial.printf("[PORTAL] Got credentials for: %s\n", ssid.c_str());
        wifiSSID = ssid;
        wifiPassword = password;
        // Don't stop AP or connect here — we're inside the HTTP handler.
        // Tearing down WiFi from within its own callback crashes the driver.
        // Set a flag and handle the AP→STA transition in wifiLoop().
        portalCredsReceived = true;
    });

    // Start NTP server on AP so connected clients can get time
    if (!ntpServer.isRunning()) {
        ntpServer.begin(&timeManager);
        Serial.println("[WIFI] NTP server started on AP");
    }

