MRC757/ESP32-WWVB-NTP-Time-Server/wwvb_clock.ino
    // Give captive portal access to time for the clock display
    captivePortal.setTimeManager(&timeManager);
    captivePortal.setTimezone(utcOffset, dstActive);
    captivePortal.setTimeSource((uint8_t)lastTimeSource);

    // Start DNS + HTTP servers on the AP
    Serial.println("[WIFI] Starting portal servers...");
    Serial.flush();
    captivePortal.begin();
    wifiState = WIFI_STATE_AP_MODE;
    Serial.println("[WIFI] AP mode fully started");
}

void wifiStopAP() {
    ntpServer.stop();
    statusServer.stop();
    captivePortal.stop();
    WiFi.softAPdisconnect(false);  // Stop AP but don't deinit WiFi driver
    WiFi.mode(WIFI_STA);           // Back to STA mode
    wifiState = WIFI_STATE_OFF;
    Serial.println("[WIFI] AP mode stopped");
}

bool wifiLoadCredentials() {
    preferences.begin("wifi", true);
    bool hasSSID = preferences.isKey("ssid");
    if (hasSSID) {
        wifiSSID = preferences.getString("ssid", "");
        wifiPassword = preferences.getString("pass", "");
    }
    preferences.end();

    if (hasSSID && wifiSSID.length() > 0) {
        Serial.printf("[WIFI] Loaded credentials for: %s\n", wifiSSID.c_str());
        return true;
    }
    return false;
}

void wifiLoop() {
    switch (wifiState) {
        case WIFI_STATE_SCANNING:
            wifiCheckScanResults();
            break;
        case WIFI_STATE_CONNECTING:
            wifiCheckConnection();
            break;
        case WIFI_STATE_CONNECTED:
            // Check for disconnect — auto-reconnect with saved credentials
            if (WiFi.status() != WL_CONNECTED) {
                Serial.println("[WIFI] Connection lost, reconnecting in 5s...");
                ntpServer.stop();
                statusServer.stop();
                delay(5000);  // Brief delay before reconnect to let the AP stabilize
                if (wifiSSID.length() > 0) {
                    wifiConnect(wifiSSID, wifiPassword);
                } else {
                    wifiState = WIFI_STATE_IDLE;
                }
            }
            break;
        case WIFI_STATE_AP_MODE:
            // Check if captive portal received credentials
            if (portalCredsReceived) {
                portalCredsReceived = false;
                Serial.println("[WIFI] Portal credentials received, shutting down AP...");
                // 1. Stop HTTP/DNS servers (WiFi untouched)
                captivePortal.stop();
                delay(100);
                // 2. Shut down the AP radio — use false to keep WiFi driver alive
                WiFi.softAPdisconnect(false);
                delay(100);
                // 3. Switch to STA-only mode so the radio is free to join any channel
                WiFi.mode(WIFI_STA);
                delay(100);
                // 4. Connect
                wifiConnect(wifiSSID, wifiPassword);
            }
            break;
        default:
            break;
    }
}

// ============================================================================
// On-Screen Keyboard Drawing
// ============================================================================
void drawKeyboardKey(int16_t x, int16_t y, int16_t w, int16_t h, const char* label, uint16_t bgColor, uint16_t textColor) {
    sprite.fillRoundRect(x, y, w, h, 4, bgColor);
    sprite.setTextColor(textColor, bgColor);
    sprite.setTextDatum(MC_DATUM);
    sprite.setTextSize(1);
    sprite.drawString(label, x + w / 2, y + h / 2);
}

void drawKeyboard() {
    if (kbMode == KB_HIDDEN) return;

    const char* row1;
    const char* row2;
    const char* row3;

    if (kbMode == KB_SYMBOLS) {
        row1 = KB_ROW1_SYM;
        row2 = KB_ROW2_SYM;
        row3 = KB_ROW3_SYM;
    } else if (kbMode == KB_UPPER) {
        row1 = KB_ROW1_UPPER;
        row2 = KB_ROW2_UPPER;
        row3 = KB_ROW3_UPPER;
    } else {
        row1 = KB_ROW1_LOWER;
        row2 = KB_ROW2_LOWER;
        row3 = KB_ROW3_LOWER;
    }

    // Input field background
    sprite.fillRoundRect(10, KB_INPUT_Y, DISPLAY_WIDTH - 20, KB_INPUT_HEIGHT, 4, 0x2104);
    sprite.setTextSize(1);
    sprite.setTextDatum(ML_DATUM);
    sprite.setTextColor(COLOR_DATE, 0x2104);

    // Show password dots or text
    if (passwordLen > 0) {
        if (passwordVisible) {
            sprite.drawString(passwordBuffer, 16, KB_INPUT_Y + KB_INPUT_HEIGHT / 2);
        } else {
            char dots[KB_PASSWORD_MAX + 1];
            int dotLen = min((int)passwordLen, KB_PASSWORD_MAX);
            memset(dots, '*', dotLen);
            dots[dotLen] = '\0';
            sprite.drawString(dots, 16, KB_INPUT_Y + KB_INPUT_HEIGHT / 2);
        }
    } else {
        sprite.setTextColor(COLOR_TEXT_DIM, 0x2104);
        sprite.drawString("Enter password", 16, KB_INPUT_Y + KB_INPUT_HEIGHT / 2);
    }

    // Show/hide toggle button (eye icon area)
    uint16_t eyeColor = passwordVisible ? COLOR_SYNC_OK : COLOR_TEXT_DIM;
    sprite.fillRoundRect(DISPLAY_WIDTH - 40, KB_INPUT_Y, 30, KB_INPUT_HEIGHT, 4, eyeColor);
    sprite.setTextColor(TFT_BLACK, eyeColor);
    sprite.setTextDatum(MC_DATUM);
    sprite.drawString("Aa", DISPLAY_WIDTH - 25, KB_INPUT_Y + KB_INPUT_HEIGHT / 2);

    uint16_t keyBg = 0x3186;    // Dark gray key background
    uint16_t keyText = COLOR_DATE;
    uint16_t specialBg = 0x2104; // Darker for special keys
    int16_t rowY;
    char keyLabel[2] = {0, 0};

    // Row 1: 10 standard keys
    rowY = KB_Y_OFFSET;
    for (int i = 0; i < 10; i++) {
        keyLabel[0] = row1[i];
        drawKeyboardKey(KB_ROW1_X + i * (KB_KEY_WIDTH + KB_KEY_GAP), rowY, KB_KEY_WIDTH, KB_KEY_HEIGHT, keyLabel, keyBg, keyText);
    }

    // Row 2: 9 standard keys
    rowY = KB_Y_OFFSET + KB_KEY_HEIGHT + KB_KEY_GAP;
    for (int i = 0; i < 9; i++) {
        keyLabel[0] = row2[i];
        drawKeyboardKey(KB_ROW2_X + i * (KB_KEY_WIDTH + KB_KEY_GAP), rowY, KB_KEY_WIDTH, KB_KEY_HEIGHT, keyLabel, keyBg, keyText);
    }

    // Row 3: Shift + 7 keys + Backspace
    rowY = KB_Y_OFFSET + 2 * (KB_KEY_HEIGHT + KB_KEY_GAP);
    // Shift key
    uint16_t shiftBg = (kbMode == KB_UPPER) ? COLOR_TIME : specialBg;
    drawKeyboardKey(KB_ROW3_X, rowY, KB_SPECIAL_WIDTH, KB_KEY_HEIGHT, "Shift", shiftBg, keyText);
    // Letter keys
    int row3Len = strlen(row3);
    int16_t row3KeyX = KB_ROW3_X + KB_SPECIAL_WIDTH + KB_KEY_GAP;
    for (int i = 0; i < row3Len; i++) {
        keyLabel[0] = row3[i];
        drawKeyboardKey(row3KeyX + i * (KB_KEY_WIDTH + KB_KEY_GAP), rowY, KB_KEY_WIDTH, KB_KEY_HEIGHT, keyLabel, keyBg, keyText);
    }
    // Backspace
    int16_t bsX = row3KeyX + row3Len * (KB_KEY_WIDTH + KB_KEY_GAP);
    drawKeyboardKey(bsX, rowY, KB_SPECIAL_WIDTH, KB_KEY_HEIGHT, "<-", specialBg, COLOR_SYNC_FAIL);

    // Row 4: 123 + Space + Connect
    rowY = KB_Y_OFFSET + 3 * (KB_KEY_HEIGHT + KB_KEY_GAP);
    const char* symLabel = (kbMode == KB_SYMBOLS) ? "abc" : "123";
    drawKeyboardKey(KB_ROW4_X, rowY, KB_SPECIAL_WIDTH, KB_KEY_HEIGHT, symLabel, specialBg, keyText);
    drawKeyboardKey(KB_ROW4_X + KB_SPECIAL_WIDTH + KB_KEY_GAP, rowY, KB_SPACE_WIDTH, KB_KEY_HEIGHT, "SPACE", keyBg, keyText);
    int16_t connectX = KB_ROW4_X + KB_SPECIAL_WIDTH + KB_KEY_GAP + KB_SPACE_WIDTH + KB_KEY_GAP;
    drawKeyboardKey(connectX, rowY, KB_CONNECT_WIDTH, KB_KEY_HEIGHT, "Connect", COLOR_SYNC_OK, TFT_BLACK);
}

