MRC757/ESP32-WWVB-NTP-Time-Server/wwvb_clock.ino
            if (scannedSecure[tapIdx]) {
                // Open keyboard for password entry
                kbMode = KB_LOWER;
                passwordLen = 0;
                passwordBuffer[0] = '\0';
                passwordVisible = false;
            } else {
                // Open network — connect directly
                wifiConnect(scannedSSIDs[tapIdx], "");
            }
        }
    }
}

// ============================================================================
// Touch Gesture Handler
// ============================================================================
void handleTouch() {
    int16_t x, y;
    bool touched = amoled.getPoint(&x, &y);

    if (touched && !touchActive) {
        // === Touch Start ===
        touchActive = true;
        touchStartX = x;
        touchStartY = y;
        touchLastX = x;
        touchLastY = y;
        touchStartTime = millis();
        swipeHandled = false;
        sliderDragging = false;
        shutdownCountdownActive = false;
    } else if (touched && touchActive) {
        // === Touch Continue (finger still down) ===
        touchLastX = x;
        touchLastY = y;
        unsigned long holdDuration = millis() - touchStartTime;

        // Check finger movement from start
        int16_t dx = abs(x - touchStartX);
        int16_t dy = abs(y - touchStartY);
        bool fingerStill = (dx < LONG_PRESS_MOVE_PX && dy < LONG_PRESS_MOVE_PX);

        // Long-press shutdown detection (only when keyboard is hidden)
        if (kbMode == KB_HIDDEN && fingerStill && holdDuration >= SHUTDOWN_HOLD_MS) {
            performShutdown();
            return;
        }

        // Show shutdown countdown overlay if holding still long enough
        if (kbMode == KB_HIDDEN && fingerStill && holdDuration >= SHUTDOWN_FEEDBACK_MS) {
            shutdownCountdownActive = true;
        }

        // Slider dragging on settings page
        if (currentPage == PAGE_SETTINGS && !fingerStill) {
            handleSliderTouch(x, y);
        }
    } else if (!touched && touchActive) {
        // === Touch End (finger lifted) ===
        touchActive = false;
        shutdownCountdownActive = false;
        unsigned long holdDuration = millis() - touchStartTime;

        int16_t deltaX = touchLastX - touchStartX;
        int16_t deltaY = touchLastY - touchStartY;

        // Save brightness if slider was dragged
        if (sliderDragging) {
            sliderDragging = false;
            preferences.begin("wwvb", false);
            preferences.putUChar("brightness", currentBrightness);
            preferences.end();
            Serial.printf("[TOUCH] Brightness saved: %d\n", currentBrightness);
        }
        // Swipe detection (disabled when keyboard is visible)
        else if (kbMode == KB_HIDDEN && abs(deltaX) > SWIPE_THRESHOLD_PX && holdDuration < 1000) {
            if (deltaX < -SWIPE_THRESHOLD_PX && currentPage < PAGE_WIFI) {
                currentPage = (DisplayPage)(currentPage + 1);
                Serial.printf("[TOUCH] Swipe left -> page %d\n", currentPage);
            } else if (deltaX > SWIPE_THRESHOLD_PX && currentPage > PAGE_CLOCK) {
                currentPage = (DisplayPage)(currentPage - 1);
                Serial.printf("[TOUCH] Swipe right -> page %d\n", currentPage);
                // Hide keyboard when leaving WiFi page
                if (currentPage != PAGE_WIFI) {
                    kbMode = KB_HIDDEN;
                }
            }
        }
        // Vertical scroll on WiFi network list
        else if (currentPage == PAGE_WIFI && kbMode == KB_HIDDEN && abs(deltaY) > 30 && abs(deltaX) < 30) {
            if (deltaY < -30 && listScrollOffset < (int)scannedCount - WIFI_MAX_VISIBLE) {
                listScrollOffset++;
            } else if (deltaY > 30 && listScrollOffset > 0) {
                listScrollOffset--;
            }
        }
        // Tap on settings page (short press, not a swipe)
        else if (currentPage == PAGE_SETTINGS && holdDuration < 500 && abs(deltaX) < SWIPE_THRESHOLD_PX) {
            // WiFi toggle button hit test (bottom left)
            int btnW = 120, btnH = 26;
            int btnX = 10;
            int btnY = DISPLAY_HEIGHT - btnH - 6;
            if (touchStartX >= btnX && touchStartX <= btnX + btnW &&
                touchStartY >= btnY && touchStartY <= btnY + btnH) {
                if (wifiState != WIFI_STATE_OFF) {
                    // Disable WiFi
                    ntpServer.stop();
                    statusServer.stop();
                    captivePortal.stop();
                    WiFi.disconnect();
                    WiFi.softAPdisconnect(false);
                    WiFi.mode(WIFI_OFF);
                    wifiState = WIFI_STATE_OFF;
                    scannedCount = 0;
                    Serial.println("[WIFI] Radio disabled from settings");
                } else {
                    // Enable WiFi — scan for networks
                    wifiScan();
                    Serial.println("[WIFI] Radio enabled from settings");
                }
            } else {
                // UTC offset +/- button hit test (bottom-right, matches drawSettingsPage)
                int utcBtnW = 30, utcBtnH = 26;
                int utcBtnY = DISPLAY_HEIGHT - utcBtnH - 6;
                int utcRightEdge = DISPLAY_WIDTH - 10;
                int utcPlusX = utcRightEdge - utcBtnW;
                int valueX = utcPlusX - 45;
                int utcMinusX = valueX - 45 - utcBtnW / 2;

                if (touchStartY >= utcBtnY && touchStartY <= utcBtnY + utcBtnH) {
                    if (touchStartX >= utcMinusX && touchStartX <= utcMinusX + utcBtnW && utcOffset > -12) {
                        utcOffset--;
                        preferences.begin("wwvb", false);
                        preferences.putChar("utcOffset", utcOffset);
                        preferences.end();
                        captivePortal.setTimezone(utcOffset, dstActive);
                        Serial.printf("[SETTINGS] UTC offset: %+d\n", utcOffset);
                    } else if (touchStartX >= utcPlusX && touchStartX <= utcPlusX + utcBtnW && utcOffset < 14) {
                        utcOffset++;
                        preferences.begin("wwvb", false);
                        preferences.putChar("utcOffset", utcOffset);
                        preferences.end();
                        captivePortal.setTimezone(utcOffset, dstActive);
                        Serial.printf("[SETTINGS] UTC offset: %+d\n", utcOffset);
                    }
                } else {
                    // Slider tap
                    handleSliderTouch(touchStartX, touchStartY);
                    if (sliderDragging) {
                        sliderDragging = false;
                        preferences.begin("wwvb", false);
                        preferences.putUChar("brightness", currentBrightness);
                        preferences.end();
                        Serial.printf("[TOUCH] Brightness tapped: %d\n", currentBrightness);
                    }
                }
            }
        }
        // Tap on WiFi page (short press)
        else if (currentPage == PAGE_WIFI && holdDuration < 500 && abs(deltaX) < SWIPE_THRESHOLD_PX) {
            handleWiFiTap(touchStartX, touchStartY);
        }
    }
}

// ============================================================================
// Display Update (with page support)
// ============================================================================
void updateDisplay() {
    static bool firstRun = true;
    if (firstRun) {
        Serial.println("updateDisplay() called for first time");
        firstRun = false;
    }

    // Clear sprite
    sprite.fillSprite(COLOR_BACKGROUND);

