MRC757/ESP32-WWVB-NTP-Time-Server/wwvb_clock.ino
    // Draw current page
    if (currentPage == PAGE_CLOCK) {
        drawClockFace(false);
        drawSyncStatus();
        drawReceptionChart();
        drawTemperature();
    } else if (currentPage == PAGE_UTC) {
        drawClockFace(true);
        drawSyncStatus();
        drawReceptionChart();
        drawTemperature();
    } else if (currentPage == PAGE_SETTINGS) {
        drawSettingsPage();
    } else if (currentPage == PAGE_WIFI) {
        drawWiFiPage();
    }

    // Draw shutdown countdown overlay on top of any page
    if (shutdownCountdownActive && touchActive) {
        unsigned long holdDuration = millis() - touchStartTime;
        drawShutdownOverlay(holdDuration);
    }

    // Push to display
    pushDisplay();
}

// ============================================================================
// Time Persistence Functions
// ============================================================================
void saveTimeToPreferences() {
    preferences.begin("wwvb", false);  // Open in read-write mode

    ClockTime utc = timeManager.getUTCTime();
    preferences.putUShort("year", utc.year);
    preferences.putUChar("month", utc.month);
    preferences.putUChar("day", utc.day);
    preferences.putUChar("hour", utc.hour);
    preferences.putUChar("minute", utc.minute);
    preferences.putUChar("second", utc.second);
    preferences.putBool("dst", dstActive);
    preferences.putULong("saveMillis", millis());

    // Persist tracking state so the 7-day window survives reboots.
    // Save the elapsed age (ms since tracking was established); restored on load
    // by reconstructing the reference point with unsigned arithmetic.
    preferences.putBool("trkReady", es100TrackingReady);
    unsigned long trkAge = es100TrackingReady ? (millis() - es100TrackingReadySinceMs) : 0xFFFFFFFFUL;
    preferences.putULong("trkAge", trkAge);

    // Persist per-antenna success counters
    preferences.putUShort("ant1ok", ant1Successes);
    preferences.putUShort("ant2ok", ant2Successes);

    preferences.end();
    Serial.println("Time saved to preferences");
}

bool loadTimeFromPreferences() {
    preferences.begin("wwvb", true);  // Open in read-only mode

    // Check if we have saved time data
    if (!preferences.isKey("year")) {
        preferences.end();
        Serial.println("No saved time found in preferences");
        return false;
    }

    uint16_t year = preferences.getUShort("year", 2025);
    uint8_t month = preferences.getUChar("month", 1);
    uint8_t day = preferences.getUChar("day", 1);
    uint8_t hour = preferences.getUChar("hour", 0);
    uint8_t minute = preferences.getUChar("minute", 0);
    uint8_t second = preferences.getUChar("second", 0);
    dstActive = preferences.getBool("dst", false);
    unsigned long saveMillis = preferences.getULong("saveMillis", 0);
    bool savedTrkReady = preferences.getBool("trkReady", false);
    unsigned long savedTrkAge = preferences.getULong("trkAge", 0xFFFFFFFFUL);
    ant1Successes = preferences.getUShort("ant1ok", 0);
    ant2Successes = preferences.getUShort("ant2ok", 0);

    preferences.end();

    // Restore tracking state if it was active and the 7-day window hasn't expired.
    // Unsigned subtraction reconstructs the original reference point correctly.
    if (savedTrkReady && savedTrkAge < ES100_TRACKING_FALLBACK_MS) {
        es100TrackingReady = true;
        es100TrackingReadySinceMs = millis() - savedTrkAge;
        Serial.printf("Tracking state restored (age: %lu ms, %lu ms remaining)\n",
                     savedTrkAge, ES100_TRACKING_FALLBACK_MS - savedTrkAge);
    }

    // Set the time
    timeManager.setTime(year, month, day, hour, minute, second);

    // Add elapsed seconds since save (only if reasonable - max 1 hour)
    // This handles quick reboots but avoids issues with millis() overflow
    unsigned long elapsedMillis = millis() - saveMillis;
    // Only apply if less than 1 hour (avoids millis() wrap issues)
    if (elapsedMillis < 3600000UL) {  // 3600000ms = 1 hour
        unsigned long elapsedSeconds = elapsedMillis / 1000;
        Serial.printf("Adjusting time forward by %lu seconds\n", elapsedSeconds);
        // Manually tick forward the time by elapsed seconds
        for (unsigned long i = 0; i < elapsedSeconds; i++) {
            timeManager.tick();
        }
    } else {
        Serial.println("Elapsed time too large or millis() wrapped - not adjusting");
    }

    Serial.printf("Loaded time from preferences: %04d-%02d-%02d %02d-%02d:%02d (DST: %s)\n",
                 year, month, day, hour, minute, second, dstActive ? "Yes" : "No");
    return true;
}

// ============================================================================
// DS3231 RTC Functions
// ============================================================================
bool initializeDS3231() {
    Serial.println("Attempting DS3231 RTC initialization...");

    // First verify a device responds at DS3231 address (0x68)
    Wire.beginTransmission(0x68);
    uint8_t i2cError = Wire.endTransmission();
    if (i2cError != 0) {
        Serial.printf("DS3231 not found at I2C address 0x68 (error: %d)\n", i2cError);
        rtcAvailable = false;
        return false;
    }

    if (!rtc.begin(&Wire)) {
        Serial.println("DS3231 library initialization failed");
        rtcAvailable = false;
        return false;
    }

    Serial.println("DS3231 RTC initialized successfully");

    // Check if RTC lost power and needs to be reset
    if (rtc.lostPower()) {
        Serial.println("WARNING: DS3231 lost power, time may be invalid");
        // Don't set a default time - wait for ES100 sync
    }

    rtcAvailable = true;
    return true;
}

bool loadTimeFromDS3231() {
    if (!rtcAvailable) {
        Serial.println("DS3231 not available");
        return false;
    }

    DateTime now = rtc.now();

    // Sanity check - year should be reasonable
    if (now.year() < 2025 || now.year() > 2100) {
        Serial.printf("DS3231 time appears invalid: %04d-%02d-%02d\n",
                     now.year(), now.month(), now.day());
        return false;
    }

    // Set TimeManager with UTC time from RTC
    timeManager.setTime(now.year(), now.month(), now.day(),
                       now.hour(), now.minute(), now.second());

    Serial.printf("Loaded time from DS3231: %04d-%02d-%02d %02d:%02d:%02d UTC\n",
                 now.year(), now.month(), now.day(),
                 now.hour(), now.minute(), now.second());

