MRC757/ESP32-WWVB-NTP-Time-Server/wwvb_clock.ino
    return false;
}

// ============================================================================
// WWVB Sync Schedule — time-aware with daytime backoff
// ============================================================================

/**
 * @brief Check if current local time is within the nighttime reception window
 * @return true if local hour is between SYNC_NIGHT_START_HOUR and SYNC_NIGHT_END_HOUR
 */
bool isNighttimeWindow() {
    if (!timeManager.isTimeSet()) return true;  // If no time yet, assume night (try aggressively)
    ClockTime local = timeManager.getLocalTime(utcOffset, dstActive);
    // Nighttime wraps midnight: e.g. 22:00 - 06:00
    return (local.hour >= SYNC_NIGHT_START_HOUR || local.hour < SYNC_NIGHT_END_HOUR);
}

/**
 * @brief Compute US DST status from the calendar
 * @details US rules: DST starts 2nd Sunday of March at 2:00 AM local standard time,
 *          ends 1st Sunday of November at 2:00 AM local standard time.
 *          Uses standard time (no DST applied) to avoid circular dependency.
 * @return true if DST should be active
 */
bool computeUSDST() {
    if (!timeManager.isTimeSet()) return false;

    // Get local STANDARD time (DST=false) to determine if DST should be active
    ClockTime local = timeManager.getLocalTime(utcOffset, false);

    // Jan, Feb, Dec: never DST
    if (local.month < 3 || local.month > 11) return false;

    // Apr through Oct: always DST
    if (local.month > 3 && local.month < 11) return true;

    // March: DST starts 2nd Sunday at 2:00 AM standard time
    if (local.month == 3) {
        int dow1 = TimeManager::calculateDayOfWeek(local.year, 3, 1);  // 0=Sunday
        int secondSunday = (1 + (7 - dow1) % 7) + 7;
        return (local.day > secondSunday) ||
               (local.day == secondSunday && local.hour >= 2);
    }

    // November: DST ends 1st Sunday at 2:00 AM standard time
    int dow1 = TimeManager::calculateDayOfWeek(local.year, 11, 1);
    int firstSunday = 1 + (7 - dow1) % 7;
    return (local.day < firstSunday) ||
           (local.day == firstSunday && local.hour < 2);
}

/**
 * @brief Get the appropriate sync interval based on time of day and failure history
 * @return Interval in milliseconds until next sync attempt
 */
unsigned long getSyncInterval() {
    // Never synced — aggressive 5-minute attempts regardless of time
    if (receptionHistory.getLastSuccessTime() == 0) {
        return SYNC_INTERVAL_INITIAL_MS;
    }

    if (isNighttimeWindow()) {
        // Nighttime: best propagation, sync every hour
        daytimeFailures = 0;
        daytimeSkipActive = false;
        return SYNC_INTERVAL_NIGHT_MS;
    }

    // Daytime: backed off after repeated failures — wait for nighttime
    if (daytimeSkipActive) {
        // Check if night has arrived to resume
        // (isNighttimeWindow() returned false, so still daytime — keep skipping)
        return SYNC_INTERVAL_DAY_MS;
    }

    // Daytime: normal 4-hour interval
    return SYNC_INTERVAL_DAY_MS;
}

/**
 * @brief Record a sync failure and activate daytime backoff if threshold reached
 */
void recordSyncFailure(bool wasTracking = false) {
    receptionHistory.recordAttempt(false);

    if (!isNighttimeWindow()) {
        uint8_t threshold = wasTracking ? SYNC_DAY_MAX_TRACKING_FAILURES : SYNC_DAY_MAX_FAILURES;
        daytimeFailures++;
        if (daytimeFailures >= threshold) {
            daytimeSkipActive = true;
            Serial.printf("[SYNC] %d consecutive daytime %s failures — skipping until nighttime\n",
                         daytimeFailures, wasTracking ? "tracking" : "normal");
        }
    }
}

// ============================================================================
// Sync Log Helper
// ============================================================================

/**
 * @brief Append one entry to the sync log ring buffer
 * @param success  True if the sync succeeded
 * @param tracking True if tracking mode was used
 * @param antenna  Antenna that was used (1 or 2; 0 = unknown)
 */
void addSyncLogEntry(bool success, bool tracking, uint8_t antenna) {
    SyncLogEntry& e = syncLog[syncLogHead];
    ClockTime t = timeManager.getUTCTime();
    snprintf(e.timeStr, sizeof(e.timeStr), "%04d-%02d-%02d %02d:%02d:%02d",
             t.year, t.month, t.day, t.hour, t.minute, t.second);
    e.success  = success;
    e.tracking = tracking;
    e.antenna  = antenna;
    syncLogHead = (syncLogHead + 1) % SYNC_LOG_SIZE;
    if (syncLogFilled < SYNC_LOG_SIZE) syncLogFilled++;
}

// ============================================================================
// ES100 Sync Functions
// ============================================================================

// Convenience wrapper: ensures tracking-ready state before calling startWWVBSync.
// Use this instead of manually setting es100TrackingReady before the call.
void startWWVBSyncTracking() {
    if (!es100TrackingReady) {
        es100TrackingReady = true;
        es100TrackingReadySinceMs = millis();
    }
    startWWVBSync(false);
}

void startWWVBSync(bool forceNormal = false) {
    if (es100Receiving) return;

    // Cancel any pending scheduled tracking start (e.g. manual sync button pressed)
    if (pendingTrackingStart) {
        pendingTrackingStart = false;
        if (es100.isPoweredOn()) es100.powerOff();
        Serial.println("[WWVB] Pending tracking start cancelled");
    }

    if (!es100Available) {
        lastSyncAttempt = millis();  // Prevent repeated calls
        return;
    }

    es100UsingTracking = false;

    if (!forceNormal && ES100_USE_TRACKING && es100TrackingReady) {
        if (millis() - es100TrackingReadySinceMs >= ES100_TRACKING_FALLBACK_MS) {
            Serial.println("[WWVB] Tracking mode expired (7 days), switching to normal mode");
            es100TrackingReady = false;
        } else {
            // Tracking reception MUST start (Control 0 write) at second :55.
            // The 22-second window captures the WWVB sync word within ±4s of drift.
            // Schedule the start; the main loop fires it at the right moment.
            ClockTime utc = timeManager.getUTCTime();
            uint8_t sec = utc.second;
            unsigned long msUntil55 = (sec <= 55) ? (unsigned long)(55 - sec) * 1000UL
                                                   : (unsigned long)(60 - sec + 55) * 1000UL;

            es100UsingTracking = true;
            lastSyncAttempt = millis();  // Prevent re-triggering during the wait
            es100InterruptFlag = false;

            // Schedule the Control 0 write for the :55 boundary.
            // Power on the ES100 shortly before :55 to satisfy the 20ms wakeup.
            // If msUntil55 is 0 (exactly at :55), the loop fires it immediately.
            pendingTrackingStart = true;
            trackingStartAtMs = millis() + msUntil55;
            Serial.printf("[WWVB] Tracking scheduled in %lus (current second: %02d)\n",
                          msUntil55 / 1000UL, sec);
            return;
        }
    }

