MRC757/ESP32-WWVB-NTP-Time-Server/wwvb_clock.ino
    // Normal mode — start with historically better antenna (toggles if it fails)
    uint8_t ctrl = (ant2Successes > ant1Successes) ? ES100_CTRL0_NORMAL_ANT2
                                                   : ES100_CTRL0_NORMAL;
    Serial.printf("[WWVB] Starting normal mode sync (prefer Ant%d, successes: Ant1=%d Ant2=%d)...\n",
                  (ant2Successes > ant1Successes) ? 2 : 1, ant1Successes, ant2Successes);
    es100InterruptFlag = false;
    if (es100.startReception(ctrl)) {
        es100Receiving = true;
        lastSyncAttempt = millis();
    } else {
        Serial.println("[WWVB] Failed to start normal reception");
        recordSyncFailure();
    }
}

void stopWWVBSync() {
    es100.stopReception();
    es100Receiving = false;
    Serial.println("WWVB sync stopped");
}

void handleES100Interrupt() {
    if (!es100InterruptFlag || !es100Receiving) return;
    
    es100InterruptFlag = false;
    
    uint8_t irqStatus = es100.readIRQStatus();
    Serial.printf("ES100 IRQ Status: 0x%02X\n", irqStatus);
    
    if (irqStatus & ES100_IRQ_RX_COMPLETE) {
        uint8_t status0 = es100.readStatus0();

        if (status0 & ES100_STATUS_RX_OK) {
            bool usedTracking = (status0 & ES100_STATUS_TRACKING) != 0;
            Serial.printf("WWVB reception successful! (%s mode)\n",
                         usedTracking ? "tracking" : "normal");

            bool syncOk  = false;
            bool ant2Used = false;  // antenna used this reception (shared by both branches)

            if (usedTracking) {
                // Tracking mode: only register 0x09 (Second) is valid.
                // Year/Month/Day/Hour/Minute are cleared to 0x00 by the START write
                // and must NOT be used — doing so would corrupt the RTC with year 2000.
                // Instead, snap only the seconds field of the current RTC time.
                uint8_t wwvbSecond;
                if (es100.readTrackingResult(&wwvbSecond, &ant2Used, status0)) {
                    ClockTime cur = timeManager.getUTCTime();
                    Serial.printf("Tracking snap: RTC was %04d-%02d-%02d %02d:%02d:%02d, "
                                  "WWVB second=%02d (Ant%d)\n",
                                  cur.year, cur.month, cur.day,
                                  cur.hour, cur.minute, cur.second,
                                  wwvbSecond, ant2Used ? 2 : 1);
                    timeManager.setTime(cur.year, cur.month, cur.day,
                                        cur.hour, cur.minute, wwvbSecond);
                    syncOk = true;
                } else {
                    Serial.println("Failed to read tracking result");
                }
            } else {
                // Normal 1-minute frame: all time registers are valid
                ES100Time rxTime;
                if (es100.readDateTime(&rxTime)) {
                    Serial.printf("Received UTC: %04d-%02d-%02d %02d:%02d:%02d\n",
                                 rxTime.year, rxTime.month, rxTime.day,
                                 rxTime.hour, rxTime.minute, rxTime.second);
                    timeManager.setTime(rxTime.year, rxTime.month, rxTime.day,
                                       rxTime.hour, rxTime.minute, rxTime.second);

                    // DST only comes from normal mode (tracking does not provide it)
                    uint8_t dstBits = (status0 >> 5) & 0x03;
                    dstActive = (dstBits >= 2);

                    // Leap second warning (bits 3:4 of Status 0; normal mode only)
                    uint8_t lsw = (status0 & ES100_STATUS_LSW_MASK) >> 3;
                    if (lsw != wwvbLeapSecondWarning) {
                        wwvbLeapSecondWarning = lsw;
                        if (lsw) Serial.printf("[WWVB] Leap second warning: %s\n",
                                               lsw == 1 ? "+1s end of month" : "-1s end of month");
                    }

                    ant2Used = rxTime.antenna2Used;
                    syncOk = true;
                } else {
                    Serial.println("Failed to read time data");
                }
            }

            if (syncOk) {
                receptionHistory.recordAttempt(true);

                // Track per-antenna successes and log the event
                if (ant2Used) ant2Successes++; else ant1Successes++;
                addSyncLogEntry(true, usedTracking, ant2Used ? 2 : 1);

                // Save time to persistent storage
                saveTimeToPreferences();
                saveTimeToDS3231();  // Also update RTC

                // Track time source
                lastTimeSource = TIME_SRC_WWVB;
                lastTimeSyncMillis = millis();
                snapshotSyncTime();
                ntpServer.setStratum(1, "WWVB");
                captivePortal.setTimeSource((uint8_t)lastTimeSource);

                // Enable tracking mode for subsequent syncs
                es100TrackingReady = true;
                es100TrackingReadySinceMs = millis();

                // Reset daytime failure tracking on any successful sync
                daytimeFailures = 0;
                daytimeSkipActive = false;

                Serial.println("Time synchronized!");
            } else {
                addSyncLogEntry(false, usedTracking, (status0 & ES100_STATUS_ANT) ? 2 : 1);
                recordSyncFailure(usedTracking);
            }
        } else {
            // Reception complete but decode failed
            if (es100UsingTracking) {
                // Tracking decode failed — poor signal conditions make normal mode (~134 s)
                // equally unlikely to succeed. Retry tracking on the next scheduled sync.
                // startWWVBSync() will fall back to normal mode after ES100_TRACKING_FALLBACK_MS.
                Serial.println("Tracking mode failed, will retry tracking on next scheduled sync");
                es100Receiving = false;
                es100UsingTracking = false;
                es100.stopReception();
                addSyncLogEntry(false, true, (status0 & ES100_STATUS_ANT) ? 2 : 1);
                recordSyncFailure(true);
                return;
            }
            Serial.println("RX_OK not set despite RX_COMPLETE");
            addSyncLogEntry(false, false, (status0 & ES100_STATUS_ANT) ? 2 : 1);
            recordSyncFailure();
        }

        es100Receiving = false;
        es100UsingTracking = false;
        es100.stopReception();

