MRC757/ESP32-WWVB-NTP-Time-Server/wwvb_clock.ino
    } else if (irqStatus & ES100_IRQ_CYCLE_COMPLETE) {
        Serial.println("Reception cycle failed, ES100 retrying...");
    }
}

// ============================================================================
// Setup
// ============================================================================
void setup() {
    Serial.begin(115200);
    delay(2000);

    // Force serial output to flush
    Serial.flush();

    Serial.println("\n\n\n========================================");
    Serial.println("  WWVB Atomic Clock - ESP32-S3");
    Serial.println("  ES100 WWVB Receiver");
    Serial.println("  Display: LilyGo-AMOLED-Series");
    Serial.println("========================================");
    Serial.printf("Boot time: %lu ms\n", millis());
    Serial.println("========================================\n");

    // Configure task watchdog timer — auto-resets on I2C lockup or infinite loop
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    esp_task_wdt_config_t wdtConfig = {
        .timeout_ms = WATCHDOG_TIMEOUT_MS,
        .idle_core_mask = 0,
        .trigger_panic = true,
    };
    esp_task_wdt_reconfigure(&wdtConfig);
#else
    esp_task_wdt_init(WATCHDOG_TIMEOUT_MS / 1000, true);
#endif
    esp_task_wdt_add(NULL);
    Serial.printf("[WDT] Watchdog configured: %ds timeout\n", WATCHDOG_TIMEOUT_MS / 1000);

    Serial.println("[BOOT] Starting initialization...");
    Serial.printf("[BOOT] Free heap: %d bytes\n", ESP.getFreeHeap());
    Serial.printf("[BOOT] PSRAM: %s\n", psramFound() ? "Found" : "Not found");

    // Initialize I2C bus 0 (touch, PMU, DS3231) - 400kHz fast mode
    Serial.println("[BOOT] Initializing I2C...");
    Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
    Wire.setClock(400000);
    Serial.println("[BOOT] Wire initialized (400kHz) - touch, PMU, DS3231 on GPIO 2/3");

    // Initialize I2C bus 1 (ES100 isolated) - 100kHz standard mode
    Wire1.begin(ES100_SDA_PIN, ES100_SCL_PIN);
    Wire1.setClock(100000);
    Serial.println("[BOOT] Wire1 initialized (100kHz) - ES100 on GPIO 15/16 (isolated)");

    // I2C bus scan on both buses
    // Note: ES100 (0x32) will NOT appear here — it only responds when EN is HIGH,
    // and EN is not driven until initializeES100() is called later in the main loop.
    Serial.println("[BOOT] Scanning Wire for devices...");
    for (uint8_t addr = 1; addr < 127; addr++) {
        Wire.beginTransmission(addr);
        if (Wire.endTransmission() == 0) {
            Serial.printf("[BOOT] Wire found device at 0x%02X\n", addr);
        }
    }
    Serial.println("[BOOT] Scanning Wire1 for devices...");
    for (uint8_t addr = 1; addr < 127; addr++) {
        Wire1.beginTransmission(addr);
        if (Wire1.endTransmission() == 0) {
            Serial.printf("[BOOT] Wire1 found device at 0x%02X\n", addr);
        }
    }
    Serial.println("[BOOT] I2C scan complete");

    // Initialize DS3231 RTC
    Serial.println("[BOOT] Initializing DS3231 RTC...");
    initializeDS3231();
    readDS3231Temperature();  // Get initial temperature reading

    // Initialize display (amoled.begin() re-initializes Wire internally for touch/PMU)
    Serial.println("[BOOT] Initializing display...");
    initDisplay();
    Serial.println("[BOOT] Display initialization complete");
    Serial.flush();  // Ensure all display messages are sent

    // Re-apply Wire clock after amoled.begin() which may reset it
    Wire.setClock(400000);
    Serial.println("[BOOT] Wire clock re-applied (400kHz)");

    // Show startup message
    Serial.println("[BOOT] Drawing startup message...");
    sprite.fillSprite(TFT_BLACK);

    // Explicitly set font to built-in Font 4
    sprite.setFreeFont(NULL);  // Use built-in fonts
    sprite.setTextFont(4);     // Font 4 is a good size

    sprite.setTextColor(TFT_CYAN, TFT_BLACK);
    sprite.setTextDatum(MC_DATUM);
    sprite.drawString("WWVB Clock", DISPLAY_WIDTH/2, DISPLAY_HEIGHT/2 - 20);
    sprite.drawString("Starting...", DISPLAY_WIDTH/2, DISPLAY_HEIGHT/2 + 20);
    Serial.println("[BOOT] Pushing startup message to display...");
    amoled.pushColors(0, 0, DISPLAY_WIDTH, DISPLAY_HEIGHT, (uint16_t*)sprite.getPointer());
    Serial.println("[BOOT] Startup message displayed");
    delay(2000);
    
    // Initialize ES100 with retry tracking
    lastES100InitAttempt = millis();

    // Clear sprite for ES100 status message
    sprite.fillSprite(TFT_BLACK);
    sprite.setFreeFont(NULL);
    sprite.setTextFont(4);
    sprite.setTextDatum(MC_DATUM);

    if (initializeES100()) {
        sprite.setTextColor(COLOR_SYNC_OK, TFT_BLACK);
        sprite.drawString("ES100: OK", DISPLAY_WIDTH/2, DISPLAY_HEIGHT/2);
    } else {
        sprite.setTextColor(COLOR_SYNC_PENDING, TFT_BLACK);
        sprite.drawString("ES100: Initializing...", DISPLAY_WIDTH/2, DISPLAY_HEIGHT/2);
        Serial.println("ES100 will retry initialization in background");
    }
    pushDisplay();
    delay(1000);

    // Show DS3231 status
    sprite.fillSprite(TFT_BLACK);
    sprite.setFreeFont(NULL);
    sprite.setTextFont(4);
    sprite.setTextDatum(MC_DATUM);

    if (rtcAvailable) {
        sprite.setTextColor(COLOR_SYNC_OK, TFT_BLACK);
        sprite.drawString("DS3231 RTC: OK", DISPLAY_WIDTH/2, DISPLAY_HEIGHT/2);
    } else {
        sprite.setTextColor(COLOR_SYNC_FAIL, TFT_BLACK);
        sprite.drawString("DS3231 RTC: Not Found", DISPLAY_WIDTH/2, DISPLAY_HEIGHT/2);
    }
    pushDisplay();
    delay(1000);

    // Attach interrupt
    Serial.println("Attaching ES100 interrupt...");
    attachInterrupt(digitalPinToInterrupt(ES100_IRQ_PIN), es100ISR, FALLING);
    Serial.println("Interrupt attached");

    // Try to load time - priority: DS3231 > Preferences > Default
    Serial.println("Loading time...");
    bool timeLoaded = false;

    if (rtcAvailable) {
        Serial.println("Trying to load time from DS3231...");
        timeLoaded = loadTimeFromDS3231();
    }

    if (!timeLoaded) {
        Serial.println("Trying to load time from preferences...");
        timeLoaded = loadTimeFromPreferences();
    }

    if (!timeLoaded) {
        // No saved time, use default
        Serial.println("Using default time: 2025-01-01 00:00:00 UTC");
        timeManager.setTime(2025, 1, 1, 0, 0, 0);
    }
    Serial.println("Time initialization complete");

    // Compute DST from calendar (overrides persisted value when no WWVB)
    if (AUTO_DST_ENABLED) {
        bool prevDST = dstActive;
        dstActive = computeUSDST();
        Serial.printf("[DST] Auto-DST: %s (was %s)\n",
                     dstActive ? "active" : "inactive",
                     prevDST ? "active" : "inactive");
    }

