MRC757/ESP32-WWVB-NTP-Time-Server/wwvb_clock.ino
    // Initialize reception history
    Serial.println("Initializing reception history...");
    receptionHistory.begin();
    Serial.println("Reception history initialized");

    delay(2000);

    // Disable touch auto-sleep so touch stays responsive
    amoled.disableAutoSleep();
    Serial.println("[BOOT] Touch screen enabled");

    // Try auto-connect WiFi with saved credentials
    if (wifiLoadCredentials()) {
        Serial.printf("[BOOT] Saved WiFi: %s — connecting...\n", wifiSSID.c_str());
        wifiConnect(wifiSSID, wifiPassword);
    }

    // Start main display
    Serial.println("Calling updateDisplay() for first time...");
    updateDisplay();
    Serial.println("updateDisplay() completed");

    // Start first sync attempt
    Serial.println("Starting initial WWVB sync...");
    startWWVBSync();

    Serial.println("Setup complete! Entering main loop...");
}

// ============================================================================
// Main Loop
// ============================================================================
void loop() {
    esp_task_wdt_reset();  // Feed watchdog — resets if loop hangs >15s

    static bool firstLoop = true;
    if (firstLoop) {
        Serial.println("*** ENTERED MAIN LOOP ***");
        firstLoop = false;
    }

    // Handle touch input (high frequency for responsive gestures)
    handleTouch();

    // WiFi state machine and services
    wifiLoop();
    if (ntpServer.isRunning()) ntpServer.handleClient();
    if (statusServer.isRunning()) statusServer.handleClient();
    if (captivePortal.isRunning()) captivePortal.handleClient();

    // Force display refresh during shutdown countdown for smooth progress bar
    if (shutdownCountdownActive) {
        updateDisplay();
    }

    // Retry ES100 initialization if needed
    if (retryES100Initialization()) {
        updateDisplay();  // Update display to show ES100 is now available
    }

    // Handle ES100 interrupts
    if (es100InterruptFlag) {
        handleES100Interrupt();
    }

    // Update display every second
    if (millis() - lastDisplayUpdate >= 1000) {
        lastDisplayUpdate = millis();

        timeManager.tick();
        syncFromDS3231();  // Read DS3231 as authoritative time source

        // Read DS3231 temperature every 64 seconds (matches sensor update rate)
        if (millis() - lastTempRead >= 64000) {
            readDS3231Temperature();
            lastTempRead = millis();
        }
        // Update status data for web server
        statusData.utcOffset = utcOffset;
        statusData.dstActive = dstActive;
        statusData.temperatureC = rtcTemperature;
        statusData.batteryMv = amoled.getBattVoltage();
        statusData.batteryPct = lipoBatteryPercent(statusData.batteryMv);
        statusData.batteryCharging = amoled.isCharging();
        statusData.timeSource = (uint8_t)lastTimeSource;
        statusData.lastSyncMillis = lastTimeSyncMillis;
        statusData.es100Available        = es100Available;
        statusData.es100Receiving        = es100Receiving;
        statusData.es100Tracking         = es100UsingTracking;
        statusData.es100PendingTracking  = pendingTrackingStart;
        statusData.leapSecondWarning     = wwvbLeapSecondWarning;
        statusData.ant1Successes         = ant1Successes;
        statusData.ant2Successes         = ant2Successes;

        // Critical battery — force deep sleep after 3 consecutive readings to protect NVS
        if (statusData.batteryPct <= CRITICAL_BATTERY_THRESHOLD &&
            !statusData.batteryCharging && statusData.batteryMv > 0) {
            critBattCount++;
            if (critBattCount >= 3) {
                Serial.printf("[BATT] CRITICAL %d%% (%.2fV) — forcing deep sleep to protect NVS\n",
                             statusData.batteryPct, statusData.batteryMv / 1000.0);
                performShutdown();
            }
        } else {
            critBattCount = 0;
        }

        // Low battery alert at threshold
        if (statusData.batteryPct <= LOW_BATTERY_THRESHOLD &&
            !statusData.batteryCharging && statusData.batteryMv > 0) {
            if (!lowBatteryAlerted) {
                lowBatteryAlerted = true;
                Serial.printf("[BATT] LOW BATTERY ALERT: %d%% (%.2fV)\n",
                             statusData.batteryPct, statusData.batteryMv / 1000.0);
            }
            // Periodic reminder every 60 seconds
            if (millis() - lastLowBattWarn >= LOW_BATTERY_WARN_MS) {
                lastLowBattWarn = millis();
                Serial.printf("[BATT] Warning: %d%% (%.2fV) — connect charger\n",
                             statusData.batteryPct, statusData.batteryMv / 1000.0);
            }
        } else if (statusData.batteryPct > LOW_BATTERY_THRESHOLD + 5) {
            // Clear alert with 5% hysteresis to prevent flapping
            lowBatteryAlerted = false;
        }

        // Auto-DST check every 60 seconds (catches transitions without WWVB)
        if (AUTO_DST_ENABLED && millis() - lastDSTCheck >= 60000) {
            lastDSTCheck = millis();
            bool newDST = computeUSDST();
            if (newDST != dstActive) {
                dstActive = newDST;
                Serial.printf("[DST] Transition detected: DST now %s\n",
                             dstActive ? "active" : "inactive");
            }
        }

        updateDisplay();
        receptionHistory.hourlyTick();
    }
    
    // Pending tracking start: fire Control 0 write at second :55
    // (tracking reception requires the write to happen at exactly :55 ± drift tolerance)
    if (pendingTrackingStart && !es100Receiving) {
        unsigned long now = millis();

        // Abort if we've waited longer than the maximum allowed pending time
        if (now > trackingStartAtMs + TRACKING_PENDING_TIMEOUT_MS) {
            Serial.println("[WWVB] Pending tracking start timed out — aborting");
            pendingTrackingStart = false;
            if (es100.isPoweredOn()) es100.powerOff();
            es100UsingTracking = false;
            recordSyncFailure(true);
        }
        // Power on ES100 ~50ms before the :55 boundary to satisfy wakeup time
        else if (!es100.isPoweredOn() && now >= trackingStartAtMs - (ES100_WAKEUP_TIME_MS + 30UL)) {
            es100.powerOn();
        }
        // Write Control 0 at the :55 boundary
        else if (now >= trackingStartAtMs) {
            pendingTrackingStart = false;
            if (es100.startReception(ES100_CTRL0_TRACK_ANT1)) {
                es100Receiving = true;
                Serial.println("[WWVB] Tracking mode sync started at :55");
            } else {
                Serial.println("[WWVB] Failed to start tracking reception at :55");
                if (es100.isPoweredOn()) es100.powerOff();
                es100UsingTracking = false;
                recordSyncFailure(true);
            }
        }
    }

    // Periodic sync attempts — time-aware schedule with daytime backoff
    if (!es100Receiving && !pendingTrackingStart) {
        unsigned long timeSinceLastAttempt = millis() - lastSyncAttempt;
        unsigned long interval = getSyncInterval();

        // Skip daytime attempts entirely after too many consecutive failures
        bool skip = daytimeSkipActive && !isNighttimeWindow();

        if (!skip && timeSinceLastAttempt >= interval) {
            startWWVBSync();
        }
    }

    // Timeout for reception attempts
    unsigned long rxTimeout = es100UsingTracking ? SYNC_TIMEOUT_TRACKING_MS : SYNC_TIMEOUT_NORMAL_MS;
    if (es100Receiving && (millis() - lastSyncAttempt > rxTimeout)) {
        if (es100UsingTracking) {
            // Tracking timed out — poor signal; normal mode would also fail.
            // Retry tracking on the next scheduled sync.
            // startWWVBSync() falls back to normal mode after ES100_TRACKING_FALLBACK_MS.
            Serial.println("Tracking mode timeout, will retry tracking on next scheduled sync");
            stopWWVBSync();
            es100UsingTracking = false;
            recordSyncFailure(true);
        } else {
            Serial.println("Reception timeout - stopping");
            stopWWVBSync();
            recordSyncFailure();
        }
    }
    
    delay(10);
}
